app/views/users/show.html.erb

SELECT "bookshelves".* FROM "bookshelves" WHERE "bookshelves"."user_id" = $1  [["user_id", 1]]
---

  <% @user.bookshelves.each do |shelf|%>